---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.MultipleNetwork
source: html/0cb74b47-484a-e11c-4284-0ee82a51ab20.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.MultipleNetwork Property

Elements in [System Name] are not connected in a single physical network due to one or both of the following:\n- There are disconnects in the system's physical network.\n- Elements in the system are connected to more than one physical network.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultipleNetwork { get; }
```